
{
"id" : "level-trading",
"name" : "Level Trading Field",
"title": "Enemyspeak - Level Trading Field",
"description" : "Online trading platform for the financial industry built with Backbone, jQuery UI, Sass, Grunt, and NodeJS. Lead developer of a team of four, responsible for all web-facing portions. Coded the desktop environment, dock, workspaces, notifications, settings, user profiles, messaging, app store, subordinate apps, payment processing, services integration, over 20 apps, and more. Additionally wrote the NodeJS back-end services that performed logins, sign ups, emailing, the messaging system, the friends system, user profiles, user preferences, app data fetching, and more.",
"keyColor" : "#717171",
"headerColor":"#f8a81f",
"year" : "2016-2017",
"imageURL" : "/img/level7.jpg",
"projects" : 	[
				{
				"name":"Homepage",
				"description" : "The Level Trading Field homepage was designed to feature a looping background video, seamless page loads and transitions, interactive grid animation, and an animated logotype. The tools page provides an overview of the platform's apps and features with looping animations showing the application running. App windows are draggable and resizable to add interactivity and demonstrate the desktop environment of the application.",
				"link" : "http://www.leveltradingfield.com",
				"year" : "2016-2017",
				"grid" : 	[
							"/img/level5.mp4",
							"/img/level8.png",
							"/img/level6.mp4",
							"/img/level6.png"
							]
				},
				{
				"name":"Desktop Environment",
				"description" : "The Level Trading Field desktop environment is a desktop experience on the web with windows that can be dragged, resized, minimized, and maximized. A dock of icons representing open applications is at the bottom. Workspaces save open windows and icons across refreshes, and allows for changing work flows quickly. Subordinate apps allow sharing synchronized data between apps.",
				"link" : "http://www.leveltradingfield.com",
				"year" : "2016-2017",
				"grid" : 	[
							"/img/level3.gif",
							"/img/level4.jpg",
							"/img/level3.mp4",
							"/img/level3.png"
							],
				"smallname" : "Desktop Features",
				"smallerGrid" : [
							"/img/dock3.mp4",
							"/img/dock1.mp4",
							"/img/dock2.mp4",
							"/img/dock4.mp4"
							]
				},
				{
				"name":"Social",
				"description" : "Level Trading Field functions as a social network specifically built for traders, featuring friends lists, private and public chats, private messaging, profiles, privacy options, notifications, and social widgets.",
				"link" : "http://www.leveltradingfield.com",
				"year" : "2016-2017",
				"grid" : 	[
							"/img/levelsocial2.mp4",
							"/img/levelsocial3.jpg",
							"/img/levelsocial1.mp4"
							]
				},
				{
				"name":"App Store & Library",
				"description" : "The Level Trading Field app drawer contains panels for managing the apps in a user's library. The library contains applications that the user has added from the app store. The store contains all applications available on Level Trading Field the user can purchase and add to their library. The app store features product information and videos, app filtering by keyword or tag, and app bundles that contain a set of apps together.",
				"link" : "http://www.leveltradingfield.com",
				"year" : "2016-2017",
				"grid" : 	[
							"/img/levelstore2.mp4",
							"/img/levelstore1.mp4"
							]
				},
				{
				"name":"Mobile",
				"description" : "Level Trading Field and each of its apps are fully responsive to support phones. In the mobile mode, features of Level Trading Field are presented in a mobile friendly, tabbed layout. On a phone, the App Store & Library collapse into a tabbed view accessible from the bottom. The top bar widgets are collected together into a new menu at the bottom. And settings are condensed into a new list view. Workspaces, the desktop, and the apps themselves all function like their desktop counterparts.",
				"link" : "http://www.leveltradingfield.com",
				"year" : "2016-2017",
				"smallerGrid" :[
							"/img/levelmobile1.png",
							"/img/levelmobile2.png",
							"/img/levelmobile4.png"
							]
				},
				{
				"name":"Admin",
				"description" : "The Level Trading Field Admin provides an interface for editing the database the NodeJS back-end services connect to. Built on Backbone, the admin panel allows managing Level Trading Field apps, blog posts, update news, job posts, chat rooms, and more. It features searchable grids, sorting by column, and a WYSIWYG editor.",
				"year" : "2017",
				"grid" : 	[
							"/img/leveladmin2.gif",
							"/img/leveladmin1.png",
							"/img/leveladmin4.gif"
							],
				"smallname" : "process",
				"smallerGrid" : [
								"/img/leveladminprocess3.gif",
								"/img/leveladminprocess1.gif"
								]
				},
				{
				"name":"Marketing",
				"description" : "To enhance the look of Level Trading Field for marketing and trade shows, animations with a 3D camera were created to emphasize our bold UI. Grids and glitch effects were achieved using GLSL shaders. Responsible for maintaining a consistent aesthetic, marketing video and animation for each app, and app stills used in store pages.",
				"link" : "https://www.youtube.com/watch?v=XXA8dIsWY9U",
				"year" : "2016-2017",
				"grid" : 	[
							"/img/levelmarketing2.mp4",
							"/img/levelmarketing1.mp4",
							"/img/levelmarketing3.mp4"
							],
				"smallname" : "process",
				"smallerGrid" : [
								"/img/levelanimation1.gif",
								"/img/marketingprocess3.gif",
								"/img/marketingprocess1.gif"
								]
				}
				]
}